//------------------------------------------------------------
//프로그램컴파일및실행//    
//Ctrl + F5------------------------------------------------------------
//개발환경및편집//    
//솔루션탐색기창이안보이면메뉴의보기솔루션탐색기     ' ' -> ' '
//키를누르면편집기의삽입모드덮어쓰기모드를Insert(Insert), (Overwrite)
//전환할수있음
//복사Ctrl + C
//붙여넣기Ctrl + V
//모두선택Ctrl + A
//편집메뉴의고급참조// ' '  ' ' 
//선택영역을주석으로바꿈Ctrl + K, C
//선택영역의주석을제거함Ctrl + K, U
//선택영역의들여쓰기규칙을맞추어줌Ctrl + K, F------------------------------------------------------------
//알파벳대문자와소문자는다른글자이므로혼용하지말것------------------------------------------------------------
//등의함수를사용하기위해서파일을포함시켜야// printf, scanf     stdio.h   
//함
//함수사용을위해#define _CRT_SECURE_NO_WARNINGS // scanf    define 
//문이먼저나와야함
//#include <stdio.h> // STanDard Input & Output
//윈도우즈운영체제는이름이인함수를호출함// ( )  main  
//int main() {
//    ...
//        운영체제에돌려주는함수값    return 0;  //   main  
//}------------------------------------------------------------
//변수값을담을수있는그릇그릇의종류에따라담을수있는값이다름// (    ,        )
//정수변수와에서int age; //  type , printf scanf %d
//실수변수와에서float height; //  type ,  printf scanf %f
//정밀도가높은실수변수와에서double weight; //    type , printf scanf 
//% lf
//문자변수와에서char ch;      //  type ,  printf scanf %c------------------------------------------------------------
//형변수는로정보를표현하며표현가능한가장작은수와가장// int   32 bit        
//큰수는임  INT_MIN, INT_MAX
//이나상수를사용하려면다음과같이파일을// INT_MIN INT_MAX     limits.h  
//해야함include
//#include <limits.h>------------------------------------------------------------
//변수에값을넣으려면대입연산자을사용하거나아래에나오//    (assignment) =   
//는함수를이용 scanf
//age = 20;
//height = 180;
//weight = 70;
//은정수이며변수는문자에해당하는// char type 8 bit  char    ASCII code 
//값을저장
//문자상수는홑따옴표를사용함ch = 'a';      //   
//의값이이므로와동일ch = 97;    // a ASCII code  97 ch = 'a'; ------------------------------------------------------------
//산술연산자나머지:  +-*/ % ()
//산술연산에서정수와정수의연산결과는정수정수와실수의연산결과는실//      ,     
//수
//정수와정수의나눗셈연산은내림으로계산됨반올림아님//      ( )
//비교연산자 : > < >=    <=    ==    !=
//    논리연산자 AND : &&
//    논리연산자 OR : ||
//    논리연산자 NOT : !------------------------------------------------------------
//    안의문자열과변수값을콘솔에출력하는함수// printf: "... "      
//    특수문자은줄바꿈는겹따옴표는홑따옴표는역슬래시//  :  \n , \" , \' , \\ 
//    형식문자는정수는실수는실수//   :  %d (int), %f (float), %lf 
//    는문자(double), % c(char)
//    콘솔창printf("%d %f %lf %c\n", age, height, weight, ch);    //  
//에출력하는함수기호개수와이일치해야함, % type------------------------------------------------------------
//키보드에서입력받는함수반드시변수명앞에를붙여야함// scanf:   ,    &  
//scanf("%d", &age);
//scanf("%f", &height);
//scanf("%lf", &weight);
//scanf("%c", &ch);------------------------------------------------------------
//증가연산자감소연산자// , 
//i++;    // i = i + 1;
//i--;      // i = i - 1'------------------------------------------------------------
//i += 2;    // i = i + 2;
//i -= 2;    // i = i - 2;
//i *= 2;    // i = i * 2;
//i /= 2;    // i = i / 2;
//i %= 2;    // i = i % 2;
//------------------------------------------------------------
//안의조건이이면다음의문장을실행// ( )  true if   
//if (number > 0)
//양수입니다    printf(" .\n);
//    여러문장실행은블럭사용if(number > 0) { //     
//    양수입니다    printf(" .\n");
//    값은입니다    printf(" %d .\n", number);
//}------------------------------------------------------------
//중첩일때는블럭을사용하여표현을명확하게함//  if  {  }     
//조건if(1) {
//    조건    if (2)
//        ...
//    else
//        ...
//}------------------------------------------------------------
//만있는경우// if, else   
//if (number > 0)
//양수입니다조건이이면실행    printf(" .\n"); //  true 
//else
//양수가아닙니다조건이이면실행    printf(" .\n"); //  false ------------------------------------------------------------
//    모두있는경우// if, else if, else   
//        조건의순서중요위에서부터인조건이있으면해당문장을실행하고//   ,  true      
//        빠져나감
//        어느조건도가아니면문장을실행//   true  else  
//        조건if(1)
//        ...
//        조건else if (2)
//        ...
//        조건else if (3)
//        ...
//        else
//        ...------------------------------------------------------------
//        조건을검사하는순서가의미있는예//     if, else if, else 
//        if (score >= 90)
//            학점    printf(" A\n");
//        else if (score >= 80)
//            학점    printf(" B\n");
//        else if (score >= 70)
//            학점    printf(" C\n");
//        else if (score >= 60)
//            학점    printf(" D\n");
//        else
//            학점    printf(" F\n");------------------------------------------------------------
//            없이만있는경우도가능// else if, else if    
//            조건if(1)
//            ...
//            조건else if (2)
//            ...
//            조건else if (3)
//            ...------------------------------------------------------------
//            문잘못사용하는사례<if    >------------------------------------------------------------
//            는로수정if(month = 2) ...  if (month == 2) ...
//            는if(0 <= score <= 100) ...  if (0 <= score && score <= 100)
//            로수정...
//            는if(0 <= score, score <= 100) ...  if (score >= 0 && score <=
//                로수정100) ...
//            또는if(month == 4 || 6 || 9 || 11) ...  if (month == 4, 6, 9
//                는수정, 11) ...
//            if (month == 4 || month == 6 || month == 9 || month == 11) ...
//                로수정------------------------------------------------------------
//                if (number > 0);
//    양수입니다    printf(" .\n);
//        조건뒤에가있으므로문과문은관련이없으며아래와동일// ( )  ;  if printf     
//        한일을함
//        if (number > 0) {
//            아무일도안함    //   
//        }
//    양수입니다printf(" .\n);------------------------------------------------------------
//        문은안의값에해당하는로들어가고를만나면빠// switch  ( )    case  break  
//        져나옴
//        switch (grade) {
//        case 1:
//            ....
//                break;
//        case 2:
//            ....
//                break;
//        case 3:
//            ....
//                break;
//        값에해당하는가없을경우default:  // year   case  
//            ....
//                마지막에는가없어도됨    //  break  
//        }------------------------------------------------------------
//            문의안의값은정수가되어야함다음은오류// switch  ( )      ,  
//                float f = 1.0;
//            switch (f)
//            {
//            case 1.0:
//                ....
//                    break;
//            case 2.0:
//                ....
//                    break;
//                ....
//            }------------------------------------------------------------
//                문은조건이나변수를사용할수없음다음은오류// switch      ,   
//                    switch (grade) {
//                        case grade > 3:
//                            ....
//                                break;
//                        case x:
//                            ....
//                                break;
//                            ....
//                    }------------------------------------------------------------
//                        문은초기화조건증감식문장으로구성되며다음과같이동작함// for  ( ; ; )      
//                                초기화// 1. 
//                                조건검사// 2.  
//                                참이면문장실행거짓이면문끝남// 3.   ,  for  
//                                증감식실행후번으로감// 4.    2 
//                                for (i = 1; i <= 9; i++)
//                                    printf("%d * %d = %d\n", n, i, n * i);------------------------------------------------------------
//                                    문은안의조건이이면뒤의문장을실행하고다시조건을검// while  ( )  true      
//                                    사하는것을반복
//                                    조건이이면뒤의문장을실행하지않고다음으로넘어감//  false while      
//                                    i = 1;
//                            while (i < 10)
//                                i++;------------------------------------------------------------
//                                i = 1;
//                            while (i <= 9) {
//                                printf("%d * %d = %d\n", n, i, n * i);
//                                i++;
//                            }------------------------------------------------------------
//                                문잘못사용하는사례<while    >------------------------------------------------------------
//                                while (i < 10);
//                            {
//                                printf("%d\n);
//                                    i++;
//                            }
//                            조건뒤에가있으므로문은블럭은관련이없음// ( )  ;  while  {  }   
//                                아래와동일한일을함//    
//                                while (i < 10)
//                                {
//                                    아무일도안함    //   
//                                }
//                            printf("%d\n);
//                                i++;---------------------------------------------------------- -